"""
    Remove background from image
"""

# ---------------------------------------------------------------------------
# اینجا پکیج مون رو از 
# pypi.org
# وارد کردم.
# برای نصب این پکیج هم از دستور زیر استفاده کردم. طبق همون چیزی که توی داکیومنتش گفته بود:
# `pip install rembg`
import rembg

# این قسمت یه متغیر از نوع رشته تعریف کردم که مسیر تصویر ورودی مون رو نگه میداره 
input_path = "/home/saeed/Pictures/animal.jpg"

# یه متغیر تعریف کردم که مسیر فایل خروجی مون رو با نامش نگه داشته.
output_path = "output.jpg"

# ----------------------------------------------------------------------------
# این خط از کد عکس ورودی رو باز کردم ب صورت 
# r -> read
# و
# b -> binary
# ----
# چون میخواستیم فقط عکس یا همون فایل رو بخونیم، پس من از مود خوندن یا همون
# r -> read
# استفاده کردم و از اونجایی که تصاویر باینری هستن پس باید حتما مود
# b -> binary
# رو هم بهش اضافه کنم.
#
# پس 
# rb 
# یعنی : فایل رو به صورت باینری باز کن.
with open(input_path, 'rb') as i:
    
    # اینجا چون میخوام فایل جدید توی این مسیر اضافه کنم اول فایل رو با مود خوندن یا همون
    # w -> write
    # باز میکنم. پس الان میتونم توی این فایل بنویسم!
    with open(output_path, 'wb') as o:

        # این خط اومدم فایل رو خوندم.
        input = i.read()

        # اینجا از پکیج استفاده کردم و طبق دستورالعمل خودش اومدم عکس رو که توی متغیر 
        # input
        # ریختم رو بهش پاس دادم
        output  = rembg.remove(input)

        # اینجا هم خروجی که تابع 
        # remove
        # پکیج بهم داده ذخیره میکنم.
        o.write(output)